<template>
  <div>
    <div class="xx">
      <h1 class="text-[35px] font-bold">Төлем және жеткізу</h1>
      <h1 class="">
        Қажетті өнімді іздеу және таңдау үшін осы сайттың каталогын пайдаланыңыз
      </h1>
      <p>
        Сайт арқылы өтінімдер "Apoteka" тәулік бойы қабылданады. Байланыс
        орталығының өтінімдерді өңдеуі және қоңырауларды қабылдауы 10:00-ден
        21:00-ге дейін үзіліссіз және демалыс күндерінсіз жүргізіледі.
      </p>
      <p>Қойма жұмысының кестесі:</p>
      <p>
        жұмыс күндері: дүйсенбі-жұма 09: 00-18: 00, демалыс күндері
        сенбі-жексенбі. <br />
        Қойманың жұмыс уақыты Қазақстан Республикасының мемлекеттік мерекелерін
        ескере отырып өзгертілуі мүмкін. <br />
        Біздің қоймадан тауарларды жеткізу бойынша барлық қажетті ақпаратты
        біздің оператордан нақтылай аласыз.
      </p>
      <h1>Тауарды алу тәсілдері</h1>
      <h1>1. Курьерлік жеткізу.</h1>
      <p>
        Қазіргі уақытта біз тапсырыстарды Әл-Фараби, Саин, Райымбек, Достық
        көшелерінің стандартты алаңында жеткіземіз. Жеткізу дәріханада немесе
        қоймада тауарлардың болуына байланысты тапсырыс берілгеннен кейін 2-3
        сағаттан кейін 10:00-ден 21:00-ге дейін демалыс күндерінсіз жүзеге
        асырылады.Ең жоғары сағатта жеткізу уақытын 3 сағатқа дейін ұзартуға
        болады. Курьерге тапсырыс беру үшін міндетті шарт-100% алдын ала төлем.
      </p>
      <p>
        Жеткізу құны - 1000 теңге. <br />
        Курьерлік жеткізу үшін ең төменгі тапсырыс - 2500 теңге.
      </p>
      <h1>2. Бір сағат ішінде жеткізу.</h1>
      <p>
        Тапсырысыңыздан кейін бір сағат ішінде қала бойынша
        Экспресс-жеткізу-2500 теңге
      </p>
      <ul
        class="space-y-1 text-gray-500 list-disc list-inside dark:text-gray-400"
      >
        <li>
          Шарттар Үлкен емес тауарларды жеткізу үшін жарамды және салмағы 2
          кг-ға дейін.
        </li>
        <li>
          Барлық жеткізу тапсырыстары тек толық алдын ала төленеді. Курьерге
          тапсырыс беру үшін міндетті шарт-бұл 100% алдын-ала төлем
        </li>
      </ul>
      <h1 class="pt-[15px]">3. Алып кету.(Самовывоз)</h1>
      <p>
        Уақытты үнемдеу үшін Сіз "алып кетуге"тапсырыс бере аласыз. Біздің
        провизор сіздің өтініміңіз бойынша жедел кеңес бере алады және Сіздің
        келуіңізге Тапсырыс дайындай алады. Дәріханаға келгеннен кейін тапсырыс
        нөмірін атап, резервтелген тауарларға ақы төлеу жеткілікті. Дәріханаға
        келу уақытын қысқарту үшін Сіз онлайн банк картасымен алдын ала төлей
        аласыз және тапсырысыңызды терезеден ала аласыз "Apoteka.kz" біздің
        дәріханада. Тапсырысыңызды күні бойы, сағат 10.00 - 22.00-ден бастап
        Айманов көшесі, 155, "Дархан"СҮ мекенжайы бойынша ала аласыз
      </p>
      <h1>4. Сіздің мекен-жайыңыз стандартты шаршыдан тыс ма?</h1>
      <p>
        Егер сіздің мекен-жайыңыз стандартты алаңда болмаса, онда сіз алып
        кетуге тапсырыс бере аласыз және/немесе Яндекс жеткізуді рәсімдей
        аласыз.Өз мекен-жайы бойынша курьер. Ол үшін курьерге біздің дәріхананың
        мекен-жайын және тапсырысыңыздың нөмірін көрсетіп, тапсырысты алдын-ала
        онлайн төлеуіңіз керек.
      </p>
      <p>
        Дәріханадан дәрі-дәрмектерді алып, Айманов көшесі, 155,"Дархан" СҮ
        мекен-жайына жеткізу
      </p>
      <h1>5. Қазақстанның кез келген өңіріне Тапсырыс ресімдеу.</h1>
      <p>
        Сіз біздің интернет - дәріханада рецепт бойынша дайындықтан басқа кез
        келген тауарға Қазақстанның кез келген өңіріне тапсырыс бере аласыз.
        Өтінімді рәсімдеп, нақты мекен-жайыңызды көрсетіңіз.
      </p>
      <p>
        Менеджер тапсырысты қабылдағаннан кейін, ол қайта қоңырау шалып, жеткізу
        ақысын Сізбен келіседі. Жеткізу құны сіз тапсырыс берген аймаққа
        байланысты жеке есептеледі. Аймақтарға тапсырыс беру үшін міндетті
        шарт-бұл 100% алдын-ала төлем.
      </p>
      <h1>6. ТМД-ның кез-келген аймағына тапсырыс беру.</h1>
      <p>
        Сіз біздің интернет - дәріханада рецепт бойынша дәрі-дәрмектерден басқа
        кез-келген тауарға ТМД-ның кез-келген аймағына тапсырыс бере аласыз.
        Өтінімді рәсімдеп, нақты мекен-жайыңызды көрсетіңіз.
      </p>
      <p>
        Менеджер тапсырысты қабылдағаннан кейін, ол қайта қоңырау шалып, жеткізу
        ақысын Сізбен келіседі. Жеткізу құны сіз тапсырыс берген аймаққа
        байланысты жеке есептеледі. Аймақтарға тапсырыс беру үшін міндетті
        шарт-бұл 100% алдын-ала төлем.
      </p>
      <h1>7. Төлем шарттары</h1>
      <ul
        class="space-y-1 text-gray-500 list-disc list-inside dark:text-gray-400"
      >
        <li>
          Курьерлік жеткізуді таңдағанда міндетті шарт - 100% онлайн алдын ала
          төлем. Сіз Visa, MasterCard, Maestro банктік пластикалық картасымен
          төлей аласыз.
        </li>
        <li>
          Дәріханадан алып кетуді рәсімдеу кезінде тапсырыс берілген тауарлар
          сайтта Paybox төлем жүйесі арқылы да төленуі мүмкін.money сіздің банк
          картаңызбен, қолма-қол ақшамен немесе дәріхана кассасындағы банк
          картасымен.
        </li>
      </ul>
      <h1 class="pt-[15px]">Сізге ыңғайлы болу үшін</h1>
      <p>
        Жол жүру схемасын Yandex карталары немесе 2Gis сілтемесінен таба аласыз
      </p>
      <p>
        Сіздің барлық сұрақтарыңыз бойынша сіз әрқашан біздің қолдау қызметіне
        хабарласа аласыз. Сау болыңыз!
      </p>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
.xx {
  max-width: 900px;
  margin: 0 auto;
}
h1 {
  padding-bottom: 25px;
  font-size: 28px;
  font-weight: bold;
}
p {
  padding-bottom: 15px;
}
</style>
