import {
    createApp
} from 'vue'
import './style.css'
import App from './App.vue'
import router from './router'
import {
    createI18n
} from 'vue-i18n'
const i18n = createI18n({
    locale: 'ru',
    fallbackLocale: 'kz',
    messages: {
        ru: {
            btn: 'Купить',
            up: "По росту",
            low: 'По убыванию',
            newsTitle: "Полезно о здоровье",
            header: {
                login: 'Войти',
                reg: 'Регистрация',
                leave: 'Выход',
                Hygiene: 'Гигиена',
                Mab: 'Мать и ребенок',
                cosmetic: 'Косметика',
                med: 'Медикаменты',
                Iap: 'Инструменты ',
                news: 'Полезно о здоровье',
                dev: 'Оплата и доставка',
                quest: 'Частые вопросы',
                comment: 'Оставить комментарий',
                conect: 'Контакты',
                basket: 'Корзина'
            },
            gridMenu: {
                btn: 'Смотреть',
                card1: 'Маски, антисептики,',
                card2: 'Все для мамы и ребенка',
                card3: "В защите вашего здоровья",
                best: 'Лучшие товары',
                comment: 'Клиенты о нас',
                news: 'Новости'
            },
            pay: {
                title: "оплата и доставка",
                title2: "используйте каталог этого сайта для поиска и выбора желаемого продукта",
                text: 'заявки через Сайт "Apoteka" принимаются круглосуточно. Обработка заявок и прием звонков контакт-центром проводится с 10: 00 до 21: 00 без перерыва и выходных дней.',
                text1: 'график работы склада:',
                text2: 'будни: понедельник-пятница 09: 00-18: 00, выходные суббота-воскресенье. Время работы склада может быть изменено с учетом государственных праздников Республики Казахстан. Всю необходимую информацию по доставке товаров с нашего склада вы можете уточнить у нашего оператора.',
                title3: "способы получения товара",
                title4: '1. курьерская доставка.',
                title4text: "в настоящее время мы доставляем заказы на стандартной площадке улиц Аль-Фараби, Саин, Райымбек, Достык. Доставка осуществляется без выходных с 10:00 до 21:00 через 2-3 часа после заказа в зависимости от наличия товара в аптеке или на складе.В часы пик время доставки может быть увеличено до 3 часов. Обязательным условием для заказа курьера является 100% предоплата.",
                title5: '2. Доставка в течение часа.',
                title5text: 'Экспресс-доставка по городу в течение часа после вашего заказа-2500 тенге Условия действительны для доставки не больших товаров и весят до 2 кг. Все заказы на доставку оплачиваются только полностью авансом. Обязательным условием для заказа курьера является 100% предоплата',
                title6: '3.забрать.(Самовоз)',
                title6text: "чтобы сэкономить время, вы можете заказать",
                самовывоз: ".Наш провизор может оперативно проконсультировать по вашей заявке и подготовить заказ на Ваш визит. По прибытии в аптеку достаточно назвать номер заказа и оплатить зарезервированные товары. Чтобы сократить время прибытия в аптеку, вы можете оплатить заранее банковской картой онлайн и забрать свой заказ из окна ",


                title7: '4. Ваш адрес выходит за рамки стандартного квадрата?',
                title7text: 'если ваш адрес не на стандартной площадке, то вы можете заказать самовывоз и/или оформить доставку на Яндекс.Курьер по своему адресу. Для этого необходимо заранее оплатить заказ онлайн, указав курьеру адрес нашей аптеки и номер вашего заказа.',
                title8: '5.Оформление заказа в любой регион Казахстана.',
                title8text: "как только Менеджер примет заказ, он перезвонит и согласует с вами плату за доставку. Стоимость доставки рассчитывается индивидуально в зависимости от региона, в котором вы заказываете. Обязательным условием для заказа в регионах является 100% предоплата.",
                title9: '6. заказ в любой регион СНГ.',
                title9text: "вы можете заказать любой товар в любой регион СНГ, кроме рецептурных препаратов, в нашей интернет - аптеке. Оформите заявку и укажите свой точный адрес. После того, как Менеджер примет заказ, он перезвонит и согласует с вами плату за доставку. Стоимость доставки рассчитывается индивидуально в зависимости от региона, в котором вы заказываете. Обязательным условием для заказа в регионах является 100% предоплата.",
                title10: '7. условия оплаты',
                title10text: 'обязательным условием при выборе курьерской доставки является 100% предоплата онлайн. Оплатить можно банковской пластиковой картой Visa, MasterCard, Maestro.',
                title11: "для вашего удобства",
                title11text: 'вы можете найти схему проезда на картах Яндекса или по ссылке 2Gis. По всем вашим вопросам вы всегда можете обратиться в нашу службу поддержки.Будьте здоровы!'
            },
            quest: {
                btn: "Показать / Скрыть",
                title: "вопросы и ответы",
                title1: "график работы онлайн-аптеки",
                title1text: " онлайн-аптеки работают 24/7. Заказать можно в любое удобное время. Операторы обрабатывают заказы с 10:00 до 21:00, без перерывов и выходных. Пункт самовывоза в Алматы работает с 10: 00 до 22: 00, без перерыва и выходных. Заказы в другие города Казахстана отправляются в рабочие дни.",
                title2: "невозможно понять заказ на сайте. Можете ли вы заказать по телефону?",
                text2: " если у вас возникли проблемы с размещением заказа на сайте apoteka.kz. заказать можно по телефону+7 777 358 77 44. фармацевт-оператор колл-центра поможет вам выбрать и заказать нужный товар",

                title3: "график работы онлайн-аптеки",
                text3: 'фармацевт-оператор колл-центра поможет вам подобрать и заказать нужный товар.',
                title4: "какие виды доставки доступны в онлайн-аптеке",

                text4: 'доставка в любой регион Казахстана – курьером в течение 2-14 дней.',
                title5: "каковы сроки доставки по городу?",
                text5: "если вам нужно срочно, вы можете оформить экспресс-доставку за дополнительную плату-тогда курьер принесет удачу вашему заказу и прибудет в течение 1 часа.",
                title6: "каковы сроки доставки по городу?",
                text6: "если вам нужно срочно, вы можете оформить экспресс-доставку за дополнительную плату-тогда курьер принесет удачу вашему заказу и прибудет в течение 1 часа",

                title7: "каковы сроки доставки в регионы Казахстана?",
                text7: "мы не отправляем в другие города лекарства, отпускаемые по рецепту врача, а также предметы, требующие особого поддержания температуры.",
                title8: "как оплатить доставку курьером?",
                text8: 'при заказе курьерской доставкой по городу Алматы вам необходимо произвести 100% предоплату онлайн с помощью Visa/Mastercard, банковской карты Kaspi.'
            },
            comment: {
                title: 'Оставить комментарий',
                comment: 'Ваше мнение',
                name: 'Ваше имя'
            },
            conect: {
                title: 'Наши контакты',
                addres: 'Адрес',
                email: 'Служба поддержки'
            },
            cardInfo: {
                price: "Цена",
                date: 'действителен до:',
                forma: "Форма выпуска:",
                quanti: 'количество в упаковке:',
                made: 'производитель',
                ablit: "доступно",
                dev: "доставим сегодня",
                skald: "на складе"
            },
            reg: {
                reg: "Регистрация",
                log: 'Вход'
            },
            basket: {
                title: 'корзина',
                tauar: "товар",
                price: "цена",
                number: 'количество',
                all: "все",
                code: "использование кода",
                spend: 'заказать',
                text: 'доставка доступна только с заказом от 2 500 тенге, но вы можете купить товар и получить его в нашей аптеке.'
            },
            offer: {
                title: "оформить заказ",
                name: "фамилия и имя",
                numberText: "номер телефона изменение статуса заказа",
                next: "следующий",
                take: 'метод получения',
                city: 'город',
                dev: 'доставка',
                devtext: 'региональная доставка по Казахстану, стоимость доставки от 2500 тенге, рассчитывается индивидуально. Мы свяжемся с вами дополнительно. Сумма предварительного заказа должна быть оплачена картой.',
                adress: "адрес получателя",
                koshe: "улица",
                home: 'Дом',
                room: 'Кв',
                spend: "оплата",
                enter: 'платить',
                Infouser: 'Информация о пользователе',
                Sposb: 'Региональная доставка'
            },
            admin: {
                zapros: 'запрос',
                addT: "Добавление товара",
                prom: "Добавление промокод ",
                addNews: "добавить Новости",
                null: 'пустой',
                city: 'город',
                koshe: "улица",
                home: 'Дом',
                room: 'Кв',
                quan: 'Количество',
                all: "все",
                spend: 'Отправить',
                Hygiene: 'Гигиена',
                Mab: 'Мать и ребенок',
                cosmetic: 'Косметика',
                med: 'Медикаменты',
                Iap: 'Инструменты ',
                name: 'имя',
                url: 'URL изображения',
                date: 'дата окончания',
                made: 'производитель',
                text: 'информация',
                price: "Цена",
                abil: 'доступность',
                add: 'добавить',


            }


        },
        kz: {
            btn: 'Сатып алу',
            up: "Өсу бойынша",
            low: 'Кему бойынша',
            newsTitle: "Денсаулық туралы пайдалы",
            header: {
                login: 'Кіру',
                leave: 'Шығу',
                Hygiene: 'Гигиена',
                Mab: 'Ана мен бала',
                cosmetic: 'Косметика',
                med: 'Дәрі-дәрмектер',
                Iap: 'Аспаптар ',
                news: 'Денсаулық туралы пайдалы',
                dev: 'Төлем және жеткізу',
                quest: 'Жиі сұрақтар',
                comment: 'Пікір қалдыру',
                conect: 'Байланыс',
                basket: 'Себет',


            },
            gridMenu: {
                btn: 'Қарау',
                card1: 'Маскалар,антисептиктер,',
                card2: 'барлығы ана мен бала үшін',
                card3: "Сіздің денсаулығыңызды қорғауда",
                best: 'Үздік тауарлар',
                comment: 'Клиенттер біз туралы',
                news: 'Жаңалықтар'
            },
            pay: {
                title: 'Төлем және жеткізу',
                title2: 'Қажетті өнімді іздеу және таңдау үшін осы сайттың каталогын пайдаланыңыз',
                text: 'Сайт арқылы өтінімдер "Apoteka" тәулік бойы қабылданады. Байланыс орталығының өтінімдерді өңдеуі және қоңырауларды қабылдауы 10:00-ден 21:00-ге дейін үзіліссіз және демалыс күндерінсіз жүргізіледі.',
                text1: 'Қойма жұмысының кестесі:',
                text2: 'жұмыс күндері: дүйсенбі-жұма 09: 00-18: 00, демалыс күндері сенбі-жексенбі. Қойманың жұмыс уақыты Қазақстан Республикасының мемлекеттік мерекелерін ескере отырып өзгертілуі мүмкін. Біздің қоймадан тауарларды жеткізу бойынша барлық қажетті ақпаратты біздің оператордан нақтылай аласыз.',
                title3: 'Тауарды алу тәсілдері',
                title4: '1. Курьерлік жеткізу.',
                title4text: 'Қазіргі уақытта біз тапсырыстарды Әл-Фараби, Саин, Райымбек, Достық көшелерінің стандартты алаңында жеткіземіз. Жеткізу дәріханада немесе қоймада тауарлардың болуына байланысты тапсырыс берілгеннен кейін 2-3 сағаттан кейін 10:00-ден 21:00-ге дейін демалыс күндерінсіз жүзеге асырылады.Ең жоғары сағатта жеткізу уақытын 3 сағатқа дейін ұзартуға болады. Курьерге тапсырыс беру үшін міндетті шарт-100% алдын ала төлем.',
                title5: '2. Бір сағат ішінде жеткізу.',
                title5text: 'Тапсырысыңыздан кейін бір сағат ішінде қала бойынша Экспресс-жеткізу-2500 теңге Шарттар Үлкен емес тауарларды жеткізу үшін жарамды және салмағы 2 кг-ға дейін. Барлық жеткізу тапсырыстары тек толық алдын ала төленеді. Курьерге тапсырыс беру үшін міндетті шарт-бұл 100% алдын-ала төлем',
                title6: '3. Алып кету.(Самовывоз)',
                title6text: 'Уақытты үнемдеу үшін Сіз "алып кетуге"тапсырыс бере аласыз. Біздің провизор сіздің өтініміңіз бойынша жедел кеңес бере алады және Сіздің келуіңізге Тапсырыс дайындай алады. Дәріханаға келгеннен кейін тапсырыс нөмірін атап, резервтелген тауарларға ақы төлеу жеткілікті. Дәріханаға келу уақытын қысқарту үшін Сіз онлайн банк картасымен алдын ала төлей аласыз және тапсырысыңызды терезеден ала аласыз "Apoteka.kz" біздің дәріханада. Тапсырысыңызды күні бойы, сағат 10.00 - 22.00-ден бастап Айманов көшесі, 155, "Дархан"СҮ мекенжайы бойынша ала аласыз',
                title7: '4. Сіздің мекен-жайыңыз стандартты шаршыдан тыс ма?',
                title7text: 'Егер сіздің мекен-жайыңыз стандартты алаңда болмаса, онда сіз алып кетуге тапсырыс бере аласыз және/немесе Яндекс жеткізуді рәсімдей аласыз.Өз мекен-жайы бойынша курьер. Ол үшін курьерге біздің дәріхананың мекен-жайын және тапсырысыңыздың нөмірін көрсетіп, тапсырысты алдын-ала онлайн төлеуіңіз керек.',
                title8: '5. Қазақстанның кез келген өңіріне Тапсырыс ресімдеу.',
                title8text: 'Менеджер тапсырысты қабылдағаннан кейін, ол қайта қоңырау шалып, жеткізу ақысын Сізбен келіседі. Жеткізу құны сіз тапсырыс берген аймаққа байланысты жеке есептеледі. Аймақтарға тапсырыс беру үшін міндетті шарт-бұл 100% алдын-ала төлем.',
                title9: '6. ТМД-ның кез-келген аймағына тапсырыс беру.',
                title9text: 'Сіз біздің интернет - дәріханада рецепт бойынша дәрі-дәрмектерден басқа кез-келген тауарға ТМД-ның кез-келген аймағына тапсырыс бере аласыз. Өтінімді рәсімдеп, нақты мекен-жайыңызды көрсетіңіз. Менеджер тапсырысты қабылдағаннан кейін, ол қайта қоңырау шалып, жеткізу ақысын Сізбен келіседі. Жеткізу құны сіз тапсырыс берген аймаққа байланысты жеке есептеледі. Аймақтарға тапсырыс беру үшін міндетті шарт-бұл 100% алдын-ала төлем.',
                title10: '7. Төлем шарттары',
                title10text: 'Дәріханадан алып кетуді рәсімдеу кезінде тапсырыс берілген тауарлар сайтта Paybox төлем жүйесі арқылы да төленуі мүмкін.money сіздің банк картаңызбен, қолма-қол ақшамен немесе дәріхана кассасындағы банк картасымен.',
                title11: 'Сізге ыңғайлы болу үшін',
                title11text: 'Жол жүру схемасын Yandex карталары немесе 2Gis сілтемесінен таба аласыз. Сіздің барлық сұрақтарыңыз бойынша сіз әрқашан біздің қолдау қызметіне хабарласа аласыз.Сау болыңыз!'
            },
            quest: {
                btn: 'Көрсету / жасыру',
                title: 'Сұрақтар мен жауаптар',
                title1: 'Онлайн дәріхананың жұмыс кестесі',
                title1text: 'Онлайн дәріханалар 24/7 жұмыс істейді. Сіз кез келген ыңғайлы уақытта тапсырыс бере аласыз. Операторлар тапсырыстарды 10:00-ден 21:00-ге дейін, үзіліссіз және демалыс күндерінсіз өңдейді. Алматы қаласындағы алып кету нүктесі 10:00-ден 22:00-ге дейін, үзіліссіз және демалыс күндерінсіз жұмыс істейді. Қазақстанның басқа қалаларына тапсырыстар жұмыс күндері жіберіледі.',
                title2: 'Сайттағы тапсырысты түсіну мүмкін емес. Телефон арқылы тапсырыс бере аласыз ба?',
                text2: 'Егер сайтта тапсырыс беру кезінде қиындықтар туындаса apoteka.kz. сіз телефон арқылы тапсырыс бере аласыз +7 777 358 77 44. Байланыс орталығының фармацевт - операторы сізге қажетті тауарларды таңдауға және тапсырыс беруге көмектеседі',

                title3: 'Онлайн дәріхананың жұмыс кестесі',
                text3: 'Байланыс орталығының фармацевт-операторы сізге қажетті тауарларды таңдауға және тапсырыс беруге көмектеседі.',
                title4: 'Онлайн дәріханада жеткізудің қандай түрлері бар?',
                text4: 'Қазақстанның кез келген өңіріне жеткізу – курьермен 2-14 күн ішінде.',
                title5: 'Қала бойынша жеткізу мерзімі қандай?',
                text5: 'Егер сізге шұғыл қажет болса, сіз қосымша ақыға жедел жеткізуді рәсімдей аласыз — содан кейін курьер сіздің тапсырысыңызға сәттілік әкеледі және 1 сағат ішінде келеді.',
                title6: 'Қала бойынша жеткізу мерзімі қандай?',
                text6: 'Егер сізге шұғыл қажет болса, сіз қосымша ақыға жедел жеткізуді рәсімдей аласыз — содан кейін курьер сіздің тапсырысыңызға сәттілік әкеледі және 1 сағат ішінде келеді.',
                title7: 'Қазақстан өңірлеріне жеткізу мерзімі қандай?',
                text7: 'Біз басқа қалаларға дәрігердің рецепті бойынша дәрі-дәрмектерді, сондай-ақ арнайы температураны сақтауды қажет ететін заттарды жібермейміз.',
                title8: 'Курьермен жеткізуді қалай төлеуге болады?',
                text8: 'Алматы қаласы бойынша курьерлік жеткізіліммен тапсырыс беру кезінде сізге Visa/Mastercard, Kaspi банк картасының көмегімен 100% Онлайн алдын ала төлем жасау қажет.'
            },
            comment: {
                title: 'Пікір қалдыру',
                comment: 'Сіздің пікіріңіз',
                name: 'Сіздің атыңыз'
            },
            conect: {
                title: 'Біздің байланыстар',
                addres: 'Мекен-жайы',
                email: 'Қолдау қызметі'
            },
            cardInfo: {
                price: 'Бағасы',
                date: 'Дейін жарамды:',
                forma: "Шығару формасы:",
                quanti: 'Қаптамадағы саны:',
                made: 'Өндіруші',
                ablit: 'Қол жетімді',
                dev: 'Бүгін жеткіземіз',
                skald: 'Қоймада'
            },
            reg: {
                reg: "Тіркеу",
                log: 'Кiру'
            },
            basket: {
                title: 'Себет',
                tauar: 'ТАУАР',
                price: 'БАҒАСЫ',
                number: 'CАНЫ',
                all: 'БАРЛЫҒЫ',
                code: 'Кодты қолдану',
                spend: 'Тапсырыс беру',
                text: 'Жеткізу тек 2 500 теңгеден бастап тапсырыспен ғана қолжетімді, бірақ сіз тауарды сатып алып, оны біздің дәріханадан ала аласыз.'
            },
            offer: {
                title: 'Тапсырысты рәсімдеу',
                name: 'Тегі және аты',
                numberText: 'туралы ескертулер үшін қолданылады',
                next: 'Келесi',
                take: 'Алу әдісі',
                city: 'Қала',
                dev: 'Жеткізу',
                devtext: 'Қазақстан бойынша өңірлік жеткізу, жеткізу құны 2500 теңгеден бастап, жеке есептеледі. Біз сізге қосымша хабарласамыз. Алдын ала тапсырыс сомасы картамен төленуі керек.',
                adress: 'Алушының мекен-жайы',
                koshe: 'Көше',
                home: 'Үй',
                room: 'Пәтер',
                spend: "Төлем",
                enter: 'Төлеу',
                Infouser: 'Пайдаланушы туралы ақпарат',
                Sposb: 'Аймақтық жеткізу'
            },
            admin: {
                zapros: 'Сұрау',
                addT: 'Товар косу',
                prom: 'Промокод косу',
                addNews: 'Жаңалықтар қосу',
                null: 'Бос',
                city: 'Қала',
                koshe: 'Көше',
                home: 'Үй',
                room: 'Пәтер',
                quan: 'Саны',
                all: 'БАРЛЫҒЫ',
                spend: 'Жіберy',
                Hygiene: 'Гигиена',
                Mab: 'Ана мен бала',
                cosmetic: 'Косметика',
                med: 'Дәрі-дәрмектер',
                Iap: 'Аспаптар ',
                name: 'Атауы',
                url: 'URL суреттер',
                date: 'Аяқталу күні',
                made: 'Өндіруші',
                text: 'Ақпарат',
                price: 'Бағасы',
                abil: 'Қол жетімділік',
                add: 'Қосу',



            }

        },
    }
})
createApp(App).use(router).use(i18n).mount('#app')